app/controllers/articles_controller.rb

    def index
      # Retrieve all articles from the database
      @articles = Article.all
---
SELECT "articles".* FROM "articles"

    def show
      # Retrieve a single article by its id parameter
      @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

    def create
      # Create a new article from the parameters passed to the article_params method
      @article = Article.new(article_params)

      if @article.save
---
INSERT INTO "articles" ("title", "body", "published", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

    def update
      # Retrieve a single article by its id parameter
      @article = Article.find(params[:id])

      if @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Article for deletion 1 - testing"], ["body", "Lorem ipsum dolor sit amet, consectetur adipiscing elit. - testing"], ["updated_at", "2023-04-29 16:05:13.107200"], ["id", 10]]

    def destroy
      # Retrieve a single article by its id parameter
      @article = Article.find(params[:id])
      # Delete the article from the database
      @article.destroy
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 10]]